Revit 2027 API
IExternalApplication.OnShutdown Method
Implement this method to execute some tasks when Autodesk Revit shuts down.
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
Result OnShutdown(
	UIControlledApplication application
)
Function OnShutdown (
	application As UIControlledApplication
) As Result
Result OnShutdown(
	UIControlledApplication^ application
)
abstract OnShutdown :
        application : UIControlledApplication -> Result
Parameters
application UIControlledApplication
A handle to the application being shut down.
Return Value
Result
Indicates if the external application completes its work successfully.
See Also
Reference
IExternalApplication Interface
Autodesk.Revit.UI Namespace